snlkuharlocal/src/DataProcessors/КонтрольОбменаДанными/КонтрольОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтрольОбменаДанными</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/Логи/Логи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Логи</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/КонтрольОбменаДанными/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт

	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец                       
		Возврат;
	КонецЕсли;
	//крохин начало 21.05.2017
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	Подразделения.Ссылка,
	//|	Подразделения.КодФизическогоУзла77
	//|ИЗ
	//|	Справочник.Подразделения КАК Подразделения
	//|ГДЕ
	//|	Подразделения.КонтролироватьАвтообмен";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подразделения.Ссылка,
	               |	Подразделения.КодФизическогоУзла77,
	               |	Основной.АдресОбмена КАК АдресОбмена
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.Основной КАК Основной
	               |		ПО Основной.Подразделение = Подразделения.Ссылка
	               |ГДЕ
	               |	Подразделения.КонтролироватьАвтообмен";
	//крохин конец 21.05.2017
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();    
	//Валетов + 08,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8095
	Если Выборка.Количество() > 0 Тогда
		МассивКодовУзлов=Новый Массив(Выборка.Количество());
		Н = 0;
		Пока Выборка.Следующий() Цикл
			//крохин начало 18.02.2022
			//прошлый вариант работал для локального адреса. Для FTP адрес обмена не пишется в логи
			//	//крохин начало 21.05.2017
			////МассивКодовУзлов[Н]=Выборка.КодФизическогоУзла77;
			//МассивКодовУзлов[Н]="" + Выборка.АдресОбмена + "%Msg_%"+Выборка.КодФизическогоУзла77;
			////крохин конец 21.05.2017
			МассивКодовУзлов[Н]=Выборка.КодФизическогоУзла77;
			//крохин конец 18.02.2022
			
			Н = Н + 1;	
		КонецЦикла;
		
		ТекстОк = "";
		ТекстОшибки = "";
		//крохин начало
		//добавим контроль константы
		Граница = Последовательности.Товары.ПолучитьГраницу().Дата;
		Если Граница >= Константы.ДатаЗапретаРедактирования.Получить() Тогда
			ТекстОк = ТекстОк + "Контроль ГП: всё в порядке. ГП: "+	Граница+Символы.ПС+Символы.ПС+Символы.ПС;
		Иначе
			ТекстОк = ТекстОк + "Контроль ГП: ГРАНИЦА ЗА КОНСТАНТОЙ! . ГП: "+	Граница+Символы.ПС+	Символы.ПС+	Символы.ПС;	
		КонецЕсли;
		//крохин конец
	КонецЕсли;//Валетов -
	//крохин начало 02.07.2019
//проверка на корректность номенклатуры, для olap
ЗапросОлап = Новый Запрос;
ЗапросОлап.Текст = "ВЫБРАТЬ
                |ОстаткиТМЦ.Период,
                |ОстаткиТМЦ.Регистратор,
                |ОстаткиТМЦ.Номенклатура,
                |ОстаткиТМЦ.Склад,
                |ОстаткиТМЦ.Количество
|ИЗ
|                РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
|ГДЕ
|                ОстаткиТМЦ.Номенклатура.Наименование ЕСТЬ NULL";

ВыборкаОлап = ЗапросОлап.Выполнить().Выбрать();
Если ВыборкаОлап.Количество() > 0 Тогда
ТекстОк = ТекстОк + Символы.ВК +"Проверка для OLAP: "+Символы.ВК;
ТекстОк = ТекстОк + "есть кривая номенклатура" + Символы.ВК;
Пока ВыборкаОлап.Следующий() Цикл
ТекстОк = ТекстОк + "Ошибка в документе: "+ВыборкаОлап.регистратор+ Символы.ВК;	
КонецЦикла;
Иначе
ТекстОк = ТекстОк + Символы.ВК + "Проверка для OLAP: "+Символы.ВК;
ТекстОк = ТекстОк + "нет кривой номенклатуры"+Символы.ВК;	
КонецЕсли;

//крохин конец 02.07.2019

	КоличествоУзлов = Выборка.Количество();
	Для Н = 0 По КоличествоУзлов - 1 Цикл 
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Логи.Сообщение,
	               |	Логи.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.Логи КАК Логи
	               |ГДЕ
	               |	Логи.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И Логи.Сообщение ПОДОБНО &Текст
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   //крохин начало 20.09.2011
				   //увеличил время проверки в связи с остановкой обмена с ТЦ с 17-00 по 21-00
//	Запрос.УстановитьПараметр("НачПериода",ТекущаяДата()-3*60*60-45*60);
//крохин начало 27.09.2011
//для письма
ДатаПроверки = ТекущаяДата();
//крохин конец 27.09.2011
	Запрос.УстановитьПараметр("НачПериода",ТекущаяДата()-6*60*60);
	//крохин конец 20.09.2011
	Запрос.УстановитьПараметр("КонПериода",ТекущаяДата());
	//крохин начало 21.05.2017
	//Запрос.УстановитьПараметр("Текст","%Получение файла: \\Srvmail2\FTPFolders$\exch80\snl\Msg_"+МассивКодовУзлов[Н]+"%");
	Запрос.УстановитьПараметр("Текст","%Получение файла:%"+МассивКодовУзлов[Н]+"%");
	//крохин конец 21.05.2017
	ВыборкаЛоги = Запрос.Выполнить().Выбрать();
	Если ВыборкаЛоги.Следующий() ТОгда
		//крохин начало 21.05.2017
	//Префикс = Сред(ВыборкаЛоги.Сообщение,56,3);
	//ТекстОк =  ТекстОк+"выгрузка: "+Префикс+" .Время: "+ВыборкаЛоги.Дата+""+Символы.ВК;
	Префикс =  Прав(МассивКодовУзлов[Н],3);
	
	ТекстОк =  ТекстОк+"выгрузка: "+Префикс+" .Время: "+ВыборкаЛоги.Дата+" "+Символы.ВК;
	//крохин конец 21.05.2017
	//сообщить("все хорошо:"+Префикс+"/"+МассивКодовУзлов[Н]+"/"+Выборка.Дата);
иначе
	//крохин начало 21.05.2017
	//ТекстОк = ТекстОк + "нет выгрузки: "+ МассивКодовУзлов[Н]+Символы.ВК;
	ТекстОк = ТекстОк +"ошибка: "+ Прав(МассивКодовУзлов[Н],3)+Символы.ВК;
	//ТекстОк =  ТекстОк+"выгрузки: "+Префикс+" .Время: "+ВыборкаЛоги.Дата+" "+Символы.ВК;
	//крохин конец 21.05.2017
	ОтправитьПисьмоВХелпДеск(МассивКодовУзлов[Н],ДатаПроверки);
	//сообщить("косяк:"+МассивКодовУзлов[Н]);
КонецЕсли;
КонецЦикла;



    Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь       = "*%*%*%";
	//Профиль.Пароль             = "*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("krohin@collant.ru");
//	Сообщение.Получатели.Добавить("melnik@collant.ru");
//крохин начало 28.01.2015
	//Сообщение.Получатели.Добавить("petrov@collant.ru");
//крохин конец 28.01.2015	
	Сообщение.Получатели.Добавить("kuhar@collant.ru");
//	Сообщение.Получатели.Добавить("helpdesk@collant.ru");
//	Сообщение.Получатели.Добавить("messerle@collant.ru");
	Сообщение.Получатели.Добавить("pokidyshev@collant.ru");
	//крохин начало 28.01.2015
	//Сообщение.Получатели.Добавить("grishakov@collant.ru");
	//крохин конец 28.01.2015
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	//крохин начало 25.05.2015
	//Сообщение.Получатели.Добавить("safonkin@collant.ru");
	//Сообщение.Получатели.Добавить("vasuhnova@collant.ru");
	//крохин конец 25.05.2015
	//крохин начало 08.07.2013
	Сообщение.Получатели.Добавить("filippov@collant.ru");                                
	//крохин конец 08.07.2013
	//Кухарь 08.05.18 начало
	  Сообщение.Получатели.Добавить("ryabchenko@collant.ru");	  	
	//Кухарь 08.05.18 конец	
	
	//крохин начало 18.07.2022 
	// Смирнов М.Ю. 12.08.2025 HELP-6450 начало
	//Сообщение.Получатели.Добавить("afanasev_m@collant.ru");
	//Сообщение.Получатели.Добавить("kovalenko@collant.ru"); 
	// Смирнов М.Ю. 12.08.2025 HELP-6450 конец
	//Сообщение.Получатели.Добавить("saraikina@collant.ru");
	//крохин конец 18.07.2022
	
	
	Сообщение.Тема="Контроль автообмена ТЦ";
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тексты.Добавить(ТекстОк);
//	Сообщение.Тексты.Добавить(ТекстОшибки);
	Почта= Новый ИнтернетПочта;
    попытка
		Почта.Подключиться(Профиль);
	исключение	
	конецПопытки;
    Попытка
		Почта.Послать(Сообщение);
	исключение
	конецПопытки;
	Почта.Отключиться();
	
	

	//"NNG,SMR,NKM,KZN,UFA,PRM,YAR,ISK,TUL,PNZ,VLG,KRN,KRD,VLD,STM,NCH,KZT,RST,ACT,TRM,GP1,GP4,KPL,KRP,KZF,KPK"
КонецПроцедуры

   	//письмо в helpdesk
	Процедура ОтправитьПисьмоВХелпДеск(КодУзла,ДатаПроверки)
	  Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь       = "*%*%*%";
	//Профиль.Пароль             = "*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("helpdesk@collant.ru");
	Сообщение.Тема="Отсутствует обмен с узлом "+ КодУзла+ " с "+Формат(ДатаПроверки-6*60*60,"ДЛФ=T")+ " по " +Формат(ДатаПроверки,"ДЛФ=T");
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тексты.Добавить("Отсутствует обмен с узлом "+КодУзла);
//	Сообщение.Тексты.Добавить(ТекстОшибки);
	Почта= Новый ИнтернетПочта;
    попытка
		Почта.Подключиться(Профиль);
	исключение	
	конецПопытки;
    Попытка
		Почта.Послать(Сообщение);
	исключение
	конецПопытки;
	Почта.Отключиться();
	
	КонецПроцедуры
